# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:

import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [4]:
# a = 
a = pd.Series([100,200,300,400])

Print a, and data type

In [5]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [7]:

print(a[2])

300

What are the values of index for series a?

In [8]:

index = [0,1,2,3,4]

Change the index to  ['c', 'a', 'b', 'd']

In [10]:
a = pd.Series([100,200,300,400],index=['a','b','c','d'])

a

a    100
b    200
c    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [13]:
print(a['d'])

400

Sort the values wrt to the index and print it

In [14]:
a_sorted = a.sort_index()

a_sorted

a    100
b    200
c    300
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [15]:
# b = 

b = pd.Series([800,450,100],index=['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [20]:
# a =
a_concatenated = pd.concat([a,b])
print(a_concatenated)

a    100
b    200
c    300
d    400
e    800
f    450
g    100
dtype: int64

In [23]:
#print a again after appending b into it

a

a    100
b    200
c    300
d    400
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [5]:
# a = 
a_sorted = a.sort_values(ascending=False)

In [25]:
a_sorted.index

Index(['d', 'c', 'b', 'a'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [26]:
# df = 
df = a.to_frame()

In [27]:
df

     0
a  100
b  200
c  300
d  400

What is the shape of the datafarme <br>
(also, what does it imply?)

In [28]:
df.shape

(4, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [7]:
# yep its same as the series.

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [29]:
df.head()
df.tail()

     0
a  100
b  200
c  300
d  400

In [30]:
df.tail()

     0
a  100
b  200
c  300
d  400

Rename the column of the dataframe as 'points'

In [31]:

df = df.rename(columns={0:'points'})
df

   points
a     100
b     200
c     300
d     400

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [34]:
#Create fruits array
import pandas as pd
import numpy as np

# fruits =
fruits_list = ['orange', 'mango', 'apple']
fruits =pd.Series(np.random.choice(fruits_list, size=7))

In [35]:
#Create series fruits out of fruits array

# fruits =

print(fruits)

0     apple
1     apple
2     apple
3    orange
4     mango
5     mango
6     apple
dtype: object

Change the index of fruits to the index of dataframe df

In [41]:
fruits

0     apple
1     apple
2     apple
3    orange
4     mango
5     mango
6     apple
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [42]:

df['fruits'] = fruits
print(df.head())

   points fruits
a     100    NaN
b     200    NaN
c     300    NaN
d     400    NaN

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [43]:
# d1 = 
data = {
    'city': ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'],
    'Temperature': [15, 22, 20, 26, -2]
}

d1 = pd.DataFrame(data)

Print(d1)

In [44]:

print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [45]:
d1.shape

(5, 2)

Set city = d1['city']

In [46]:

city = d1['city']
print(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

print city <br>
What is the type of city.

In [47]:

print(type(city))

<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [48]:
# d2 = 
data = {
    'city': ['Bengaluru', 'Coimbatore', 'Srirangam', 'Pondicherry'],
    'Temperature': [24, 35, 36, 39]
}

d2 = pd.DataFrame(data)

print(d2)

          city  Temperature
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [49]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [50]:
# d3 = 

d3 = pd.concat([d1, d2])
print(d3)

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [51]:
d3_filtered = d3[d3['Temperature'] <= 20]
print(d3_filtered)

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [52]:
d3_filtered = d3[d3['Temperature'] >= 35]
print(d3_filtered)

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [53]:
# write function here

# def is_ut(x):
    
#     # write code below
    
# d3['is_ut'] = 

d3['is_union_territory'] = d3['city'].isin(['Chandigarh', 'Pondicherry', 'Delhi'])
print(d3)

          city  Temperature  is_union_territory
0   Chandigarh           15                True
1        Delhi           22                True
2       Kanpur           20               False
3      Chennai           26               False
4       Manali           -2               False
0    Bengaluru           24               False
1   Coimbatore           35               False
2    Srirangam           36               False
3  Pondicherry           39                True

In [55]:
print (d3)

          city  Temperature  is_union_territory
0   Chandigarh           15                True
1        Delhi           22                True
2       Kanpur           20               False
3      Chennai           26               False
4       Manali           -2               False
0    Bengaluru           24               False
1   Coimbatore           35               False
2    Srirangam           36               False
3  Pondicherry           39                True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [56]:
# write function here


def c_to_f(temp):
    return (temp * 9/5) + 32

d3['Temperature_Fahrenheit'] = d3['Temperature'].apply(c_to_f)
print(d3)

          city  Temperature  is_union_territory  Temperature_Fahrenheit
0   Chandigarh           15                True                    59.0
1        Delhi           22                True                    71.6
2       Kanpur           20               False                    68.0
3      Chennai           26               False                    78.8
4       Manali           -2               False                    28.4
0    Bengaluru           24               False                    75.2
1   Coimbatore           35               False                    95.0
2    Srirangam           36               False                    96.8
3  Pondicherry           39                True                   102.2

In [17]:
# check function c_to_f(10)

In [18]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [57]:
d1_union_territories = d1[d1['city'].isin(['Chandigarh', 'Delhi', 'Pondicherry'])]
print(d1_union_territories)

         city  Temperature
0  Chandigarh           15
1       Delhi           22

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [60]:


d1_high_temp = d1[d1['Temperature'] > 32]  # Convert 90 F to C: 90 - 32 = 58, then compare with C
print(d1_high_temp)

d3_high_temp = d3[d3['Temperature_Fahrenheit'] > 90]
print(d3_high_temp)

Empty DataFrame
Columns: [city, Temperature]
Index: []
          city  Temperature  is_union_territory  Temperature_Fahrenheit
1   Coimbatore           35               False                    95.0
2    Srirangam           36               False                    96.8
3  Pondicherry           39                True                   102.2

Select only the first three rows of the dataframe d1.

In [61]:

d1_first_three = d1.head(3)
print(d1_first_three)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [62]:
d3_selected = d3.iloc[:, -2:]
print(d3_selected)

   is_union_territory  Temperature_Fahrenheit
0                True                    59.0
1                True                    71.6
2               False                    68.0
3               False                    78.8
4               False                    28.4
0               False                    75.2
1               False                    95.0
2               False                    96.8
3                True                   102.2

## Groupby

In [63]:
# Create a dataframe using dictionary of your choice

# data = 

data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 24, 35, 32],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)

print(df)

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [64]:
# Use Groupby of single column with aggregate sum()


data = {
    'City': ['New York', 'Paris', 'New York', 'Paris', 'London', 'London'],
    'Population': [8000000, 2000000, 8000000, 2000000, 6000000, 6000000]
}

df = pd.DataFrame(data)

grouped_df = df.groupby('City')['Population'].sum()

print(grouped_df)

City
London      12000000
New York    16000000
Paris        4000000
Name: Population, dtype: int64

In [65]:
# Use Groupby of single column with aggregate count()

df = pd.DataFrame(data)

grouped_df = df.groupby('City')['Population'].count()

print(grouped_df)

City
London      2
New York    2
Paris       2
Name: Population, dtype: int64

In [66]:
# Use Groupby of single column with aggregate min() and max()

data = {
    'City': ['New York', 'Paris', 'New York', 'Paris', 'London', 'London', 'New York'],
    'Temperature': [20, 15, 25, 20, 10, 15, 30]
}

df = pd.DataFrame(data)

grouped_df_min = df.groupby('City')['Temperature'].min()
grouped_df_max = df.groupby('City')['Temperature'].max()

print("Minimum Temperature:")
print(grouped_df_min)
print("\nMaximum Temperature:")
print(grouped_df_max)

Minimum Temperature:
City
London      10
New York    20
Paris       15
Name: Temperature, dtype: int64

Maximum Temperature:
City
London      15
New York    30
Paris       20
Name: Temperature, dtype: int64

In [67]:
# Use Groupby of any 2 columns with aggregate mean()


data = {
    'City': ['New York', 'Paris', 'New York', 'Paris', 'London', 'London', 'New York'],
    'Year': [2020, 2020, 2021, 2021, 2020, 2021, 2022],
    'Temperature': [20, 15, 25, 20, 10, 15, 30]
}

df = pd.DataFrame(data)

grouped_df = df.groupby(['City', 'Year'])['Temperature'].mean()

print(grouped_df)

City      Year
London    2020    10.0
          2021    15.0
New York  2020    20.0
          2021    25.0
          2022    30.0
Paris     2020    15.0
          2021    20.0
Name: Temperature, dtype: float64

In [68]:
# Use Groupby of any 2 columns with aggregate min() and max()


df = pd.DataFrame(data)

grouped_df_min = df.groupby(['City', 'Year'])['Temperature'].min()
grouped_df_max = df.groupby(['City', 'Year'])['Temperature'].max()

print("Minimum Temperature:")
print(grouped_df_min)
print("\nMaximum Temperature:")
print(grouped_df_max)

Minimum Temperature:
City      Year
London    2020    10
          2021    15
New York  2020    20
          2021    25
          2022    30
Paris     2020    15
          2021    20
Name: Temperature, dtype: int64

Maximum Temperature:
City      Year
London    2020    10
          2021    15
New York  2020    20
          2021    25
          2022    30
Paris     2020    15
          2021    20
Name: Temperature, dtype: int64

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [69]:
# a = 

a = pd.date_range(start='1/1/2020', end='4/1/2021')

print a

In [70]:

a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [71]:

print(len(a))

457

What is the type of a?

In [72]:
print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>